report/tsung/configs/config_single.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/Cellar/tsung/1.7.0/share/tsung/tsung-1.0.dtd">
<!-- <!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd"> -->

<tsung loglevel="notice" version="1.0">

  <clients>
    <client host='localhost' use_controller_vm='true'/>
  </clients>

  <servers>
    <server host="172.16.10.51" port="8080" type="tcp"></server>
  </servers>

  <monitoring>
    <monitor host="shibepad.lan" type="snmp">
      <snmp version="v2" community="public" port="161">
        <oid value="1.3.6.1.2.1.2.2.1.10.0" name="ifInOctets" type="counter"/>
        <oid value="1.3.6.1.2.1.2.2.1.14.0" name="ifInErrors" type="counter"/>
      </snmp>
    </monitor>
  </monitoring>

  <load>
    <arrivalphase phase="1" duration="30" unit="minute" wait_all_sessions_end="true">
      <users interarrival="2.741" unit="second"/>
    </arrivalphase>
    <!-- <arrivalphase phase="2" duration="30" unit="minute" wait_all_sessions_end="true">
      <users interarrival="4.984" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="minute" wait_all_sessions_end="true">
      <users interarrival="3.115" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="30" unit="minute" wait_all_sessions_end="true">
      <users interarrival="2.931" unit="second"/>
    </arrivalphase> -->
  </load>

  <sessions>
    <session name='sess1' probability='16' type='ts_http'>
      <request>
        <http url='/query/route' version='1.1' contents='{&quot;CITY_A&quot;:&quot;Memphis, TN&quot;,&quot;CITY_B&quot;:&quot;San Antonio, TX&quot;,&quot;DATE_FROM&quot;:0,&quot;DATE_TO&quot;:1589479617088,&quot;OP_CARRIER_AIRLINE_ID&quot;:null}' content_type='application/json' method='POST'>
          <http_header name='Accept' value='application/json' />
          <http_header name='Accept-Encoding' value='gzip, deflate' />
          <http_header name='Accept-Language' value='it-IT,it;q=0.8,en-US;q=0.5,en;q=0.3' />
          <http_header name='Cache-Control' value='no-cache' />
          <http_header name='Pragma' value='no-cache' />
        </http>
      </request>
    </session>
    <session name='sess2' probability='16' type='ts_http'>
      <request>
        <http url='/query/route' version='1.1' contents='{&quot;CITY_A&quot;:&quot;Dallas/Fort Worth, TX&quot;,&quot;CITY_B&quot;:&quot;San Antonio, TX&quot;,&quot;DATE_FROM&quot;:0,&quot;DATE_TO&quot;:1589479617088,&quot;OP_CARRIER_AIRLINE_ID&quot;:null}' content_type='application/json' method='POST'>
          <http_header name='Accept' value='application/json' />
          <http_header name='Accept-Encoding' value='gzip, deflate' />
          <http_header name='Accept-Language' value='it-IT,it;q=0.8,en-US;q=0.5,en;q=0.3' />
          <http_header name='Cache-Control' value='no-cache' />
          <http_header name='Pragma' value='no-cache' />
        </http>
      </request>
    </session>
    <session name='sess3' probability='17' type='ts_http'>
      <request>
        <http url='/query/route' version='1.1' contents='{&quot;CITY_A&quot;:&quot;Dallas/Fort Worth, TX&quot;,&quot;CITY_B&quot;:&quot;New York, NY&quot;,&quot;DATE_FROM&quot;:0,&quot;DATE_TO&quot;:1589479617088,&quot;OP_CARRIER_AIRLINE_ID&quot;:null}' content_type='application/json' method='POST'>
          <http_header name='Accept' value='application/json' />
          <http_header name='Accept-Encoding' value='gzip, deflate' />
          <http_header name='Accept-Language' value='it-IT,it;q=0.8,en-US;q=0.5,en;q=0.3' />
          <http_header name='Cache-Control' value='no-cache' />
          <http_header name='Pragma' value='no-cache' />
        </http>
      </request>
    </session>
    <session name='sess4' probability='17' type='ts_http'>
      <request>
        <http url='/query/route' version='1.1' contents='{&quot;CITY_A&quot;:&quot;Baton Rouge, LA&quot;,&quot;CITY_B&quot;:&quot;Memphis, TN&quot;,&quot;DATE_FROM&quot;:0,&quot;DATE_TO&quot;:1589479617088,&quot;OP_CARRIER_AIRLINE_ID&quot;:null}' content_type='application/json' method='POST'>
          <http_header name='Accept' value='application/json' />
          <http_header name='Accept-Encoding' value='gzip, deflate' />
          <http_header name='Accept-Language' value='it-IT,it;q=0.8,en-US;q=0.5,en;q=0.3' />
          <http_header name='Cache-Control' value='no-cache' />
          <http_header name='Pragma' value='no-cache' />
        </http>
      </request>
    </session>
    <session name='sess5' probability='17' type='ts_http'>
      <request>
        <http url='/query/route' version='1.1' contents='{&quot;CITY_A&quot;:&quot;Baton Rouge, LA&quot;,&quot;CITY_B&quot;:&quot;Ithaca/Cortland, NY&quot;,&quot;DATE_FROM&quot;:0,&quot;DATE_TO&quot;:1589479617088,&quot;OP_CARRIER_AIRLINE_ID&quot;:null}' content_type='application/json' method='POST'>
          <http_header name='Accept' value='application/json' />
          <http_header name='Accept-Encoding' value='gzip, deflate' />
          <http_header name='Accept-Language' value='it-IT,it;q=0.8,en-US;q=0.5,en;q=0.3' />
          <http_header name='Cache-Control' value='no-cache' />
          <http_header name='Pragma' value='no-cache' />
        </http>
      </request>
    </session>
    <session name='sess6' probability='17' type='ts_http'>
      <request>
        <http url='/query/route' version='1.1' contents='{&quot;CITY_A&quot;:&quot;Ithaca/Cortland, NY&quot;,&quot;CITY_B&quot;:&quot;Detroit, MI&quot;,&quot;DATE_FROM&quot;:0,&quot;DATE_TO&quot;:1589479617088,&quot;OP_CARRIER_AIRLINE_ID&quot;:null}' content_type='application/json' method='POST'>
          <http_header name='Accept' value='application/json' />
          <http_header name='Accept-Encoding' value='gzip, deflate' />
          <http_header name='Accept-Language' value='it-IT,it;q=0.8,en-US;q=0.5,en;q=0.3' />
          <http_header name='Cache-Control' value='no-cache' />
          <http_header name='Pragma' value='no-cache' />
        </http>
      </request>
    </session>
  </sessions>
</tsung>